docs: replace first graph to mermaid
